## Text in Pandas 
- pandas string functions  - lower, upper

In [3]:
## Libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from pydataset import data

In [4]:
np.set_printoptions(precision=2)
pd.set_option("display.precision", 1)
pd.set_option('display.max_rows', 500)
pd.set_option('display.max_columns', 500)
pd.set_option('display.width', 1000)

In [5]:
# data
df1 = data('mtcars')
df1.head()

                    mpg  cyl   disp   hp  drat   wt  qsec  vs  am  gear  carb
Mazda RX4          21.0    6  160.0  110   3.9  2.6  16.5   0   1     4     4
Mazda RX4 Wag      21.0    6  160.0  110   3.9  2.9  17.0   0   1     4     4
Datsun 710         22.8    4  108.0   93   3.9  2.3  18.6   1   1     4     1
Hornet 4 Drive     21.4    6  258.0  110   3.1  3.2  19.4   1   0     3     1
Hornet Sportabout  18.7    8  360.0  175   3.1  3.4  17.0   0   0     3     2

In [6]:
df1.reset_index(level=0, inplace=True)
df1.head()

               index   mpg  cyl   disp   hp  drat   wt  qsec  vs  am  gear  carb
0          Mazda RX4  21.0    6  160.0  110   3.9  2.6  16.5   0   1     4     4
1      Mazda RX4 Wag  21.0    6  160.0  110   3.9  2.9  17.0   0   1     4     4
2         Datsun 710  22.8    4  108.0   93   3.9  2.3  18.6   1   1     4     1
3     Hornet 4 Drive  21.4    6  258.0  110   3.1  3.2  19.4   1   0     3     1
4  Hornet Sportabout  18.7    8  360.0  175   3.1  3.4  17.0   0   0     3     2

In [7]:
df1.rename(columns={'index': 'carName'}, inplace=True)  #new=old
#df1['carname'] = df1.index

In [8]:
df1.head()

             carName   mpg  cyl   disp   hp  drat   wt  qsec  vs  am  gear  carb
0          Mazda RX4  21.0    6  160.0  110   3.9  2.6  16.5   0   1     4     4
1      Mazda RX4 Wag  21.0    6  160.0  110   3.9  2.9  17.0   0   1     4     4
2         Datsun 710  22.8    4  108.0   93   3.9  2.3  18.6   1   1     4     1
3     Hornet 4 Drive  21.4    6  258.0  110   3.1  3.2  19.4   1   0     3     1
4  Hornet Sportabout  18.7    8  360.0  175   3.1  3.4  17.0   0   0     3     2

In [13]:
df1.carName.str.upper() [0:5]

0            MAZDA RX4
1        MAZDA RX4 WAG
2           DATSUN 710
3       HORNET 4 DRIVE
4    HORNET SPORTABOUT
Name: carName, dtype: object

In [14]:
df1.carName.str.lower() [0:5]

0            mazda rx4
1        mazda rx4 wag
2           datsun 710
3       hornet 4 drive
4    hornet sportabout
Name: carName, dtype: object

In [15]:
df1.carName.str.len() [0:5]

0     9
1    13
2    10
3    14
4    17
Name: carName, dtype: int64

In [26]:
df1.carName.str.slice(0,5) [0:5]

0    Mazda
1    Mazda
2    Datsu
3    Horne
4    Horne
Name: carName, dtype: object

In [29]:
df1.carName.str[0:6][0:5]

0    Mazda
1    Mazda
2    Datsun
3    Hornet
4    Hornet
Name: carName, dtype: object

In [30]:
df1.carName.str.slice_replace(3,8,'New Cars')

0               MazNew Cars4
1           MazNew Cars4 Wag
2              DatNew Cars10
3          HorNew Cars Drive
4       HorNew Carsportabout
5                ValNew Cars
6              DusNew Cars60
7               MerNew CarsD
8                MerNew Cars
9                MerNew Cars
10              MerNew CarsC
11             MerNew CarsSE
12             MerNew CarsSL
13            MerNew CarsSLC
14     CadNew Cars Fleetwood
15    LinNew CarsContinental
16      ChrNew Cars Imperial
17               FiaNew Cars
18            HonNew Carsvic
19         ToyNew Carsorolla
20          ToyNew Carsorona
21       DodNew Carsallenger
22            AMCNew Carslin
23             CamNew Cars28
24       PonNew CarsFirebird
25              FiaNew Cars9
26          PorNew Cars914-2
27           LotNew Carsropa
28         ForNew Carstera L
29           FerNew CarsDino
30          MasNew Cars Bora
31             VolNew Cars2E
Name: carName, dtype: object

In [31]:
df1.carName.str.replace('Mazda','Tata')

0                Tata RX4
1            Tata RX4 Wag
2              Datsun 710
3          Hornet 4 Drive
4       Hornet Sportabout
5                 Valiant
6              Duster 360
7               Merc 240D
8                Merc 230
9                Merc 280
10              Merc 280C
11             Merc 450SE
12             Merc 450SL
13            Merc 450SLC
14     Cadillac Fleetwood
15    Lincoln Continental
16      Chrysler Imperial
17               Fiat 128
18            Honda Civic
19         Toyota Corolla
20          Toyota Corona
21       Dodge Challenger
22            AMC Javelin
23             Camaro Z28
24       Pontiac Firebird
25              Fiat X1-9
26          Porsche 914-2
27           Lotus Europa
28         Ford Pantera L
29           Ferrari Dino
30          Maserati Bora
31             Volvo 142E
Name: carName, dtype: object

In [34]:
carSelect = df1.carName.str.lower().str.contains('mazda|merc')
df1.carName[carSelect]

0         Mazda RX4
1     Mazda RX4 Wag
7         Merc 240D
8          Merc 230
9          Merc 280
10        Merc 280C
11       Merc 450SE
12       Merc 450SL
13      Merc 450SLC
Name: carName, dtype: object

In [20]:
#search for string
subS1 = 'Mazda'
df1['carName'].str.find(subS1)[1:5]
#if 0 - find

1    0
2   -1
3   -1
4   -1
Name: carName, dtype: int64

In [17]:
df1.carName.str.split() [0:5]

0            [Mazda, RX4]
1       [Mazda, RX4, Wag]
2           [Datsun, 710]
3      [Hornet, 4, Drive]
4    [Hornet, Sportabout]
Name: carName, dtype: object

In [18]:
df1.carName.str.split() [0:5][0][1]

'RX4'

In [19]:
df1.carName.str.split('X') [0:5]

0           [Mazda R, 4]
1       [Mazda R, 4 Wag]
2           [Datsun 710]
3       [Hornet 4 Drive]
4    [Hornet Sportabout]
Name: carName, dtype: object

In [25]:
df1.carName.str.cat()   #all into 1 string

'Mazda RX4Mazda RX4 WagDatsun 710Hornet 4 DriveHornet SportaboutValiantDuster 360Merc 240DMerc 230Merc 280Merc 280CMerc 450SEMerc 450SLMerc 450SLCCadillac FleetwoodLincoln ContinentalChrysler ImperialFiat 128Honda CivicToyota CorollaToyota CoronaDodge ChallengerAMC JavelinCamaro Z28Pontiac FirebirdFiat X1-9Porsche 914-2Lotus EuropaFord Pantera LFerrari DinoMaserati BoraVolvo 142E'

In [10]:
df1.loc[df1['carName'].str.find(subS1)== 0, :]

         carName   mpg  cyl   disp   hp  drat   wt  qsec  vs  am  gear  carb
0      Mazda RX4  21.0    6  160.0  110   3.9  2.6  16.5   0   1     4     4
1  Mazda RX4 Wag  21.0    6  160.0  110   3.9  2.9  17.0   0   1     4     4

In [28]:
df1['carName'].str.contains(subS1)

0      True
1      True
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29    False
30    False
31    False
Name: carName, dtype: bool

In [29]:
df1[df1['carName'].str.contains(subS1)]  #looks better

         carName   mpg  cyl   disp   hp  drat   wt  qsec  vs  am  gear  carb
0      Mazda RX4  21.0    6  160.0  110   3.9  2.6  16.5   0   1     4     4
1  Mazda RX4 Wag  21.0    6  160.0  110   3.9  2.9  17.0   0   1     4     4

In [36]:
# search in full DF
#df1[df1.eq(subS1)]

In [43]:
df1[df1.apply(lambda row:row.astype(str).str.contains('Drive', case=False).any(), axis=1)]

          carName   mpg  cyl   disp   hp  drat   wt  qsec  vs  am  gear  carb
3  Hornet 4 Drive  21.4    6  258.0  110   3.1  3.2  19.4   1   0     3     1

In [45]:
subS2 = '21.0'# it should be string
df1[df1.apply(lambda row:row.astype(str).str.contains(subS2, case=False).any(), axis=1)]

          carName   mpg  cyl   disp   hp  drat   wt  qsec  vs  am  gear  carb
0       Mazda RX4  21.0    6  160.0  110   3.9  2.6  16.5   0   1     4     4
1   Mazda RX4 Wag  21.0    6  160.0  110   3.9  2.9  17.0   0   1     4     4
31     Volvo 142E  21.4    4  121.0  109   4.1  2.8  18.6   1   1     4     2

In [67]:
df1.query("mpg > 20 & carName.str.contains('Volvo')")

       carName   mpg  cyl   disp   hp  drat   wt  qsec  vs  am  gear  carb
31  Volvo 142E  21.4    4  121.0  109   4.1  2.8  18.6   1   1     4     2

In [75]:
np21 = np.where((df1['mpg'] > 20) & (df1['carName'].str.contains('Volvo')))  #note brackers

In [76]:
df1.loc[np21]

       carName   mpg  cyl   disp   hp  drat   wt  qsec  vs  am  gear  carb
31  Volvo 142E  21.4    4  121.0  109   4.1  2.8  18.6   1   1     4     2